[GENERAL]
NAME					= English
TRANSLATOR				= Bandisoft
DLG_FONT_NAME				= 
DLG_FONT_SIZE				= 


[TEXT]
TEXT_MESSAGEBOX_OK			= OK
TEXT_MESSAGEBOX_CANCEL			= Cancel
TEXT_MESSAGEBOX_ABORT			= Abort
TEXT_MESSAGEBOX_RETRY			= Retry
TEXT_MESSAGEBOX_IGNORE			= Ignore
TEXT_MESSAGEBOX_YES			= Yes
TEXT_MESSAGEBOX_NO			= No
TEXT_MESSAGEBOX_CONTINUE		= Continue

TEXT_APP_NAME				= Honeyview
TEXT_BETA				= Beta
TEXT_PORTABLE				= Portable
TEXT_BUILDNO				= Build#
TEXT_SELECT_FOLDER			= Select a folder.
TEXT_ASSOC_IMAGE			= Image (${str1}) File
TEXT_ASSOC_RAWIMAGE			= RAW Image (${str1}) File
TEXT_ASSOC_EBOOK			= Compressed Image (${str1}) File
TEXT_APP_DESC				= Honeyview is an ultrafast image viewer.
TEXT_ABOUTBOX_TAB1			= About Honeyview
TEXT_PHOTOFOLDER_NAME			= Honeyview
TEXT_OPENFILEDLG_IMAGEFILE		= Image File
TEXT_OPENFILEDLG_ALLFILE		= All Files
TEXT_NEW_FOLDER				= New Folder
TEXT_TRANSF_FILE_BEGIN_WITH		= Honeyview_

TEXT_UPDATE_DOWNLOAD_ERROR_MSG		= Failed to download required installation files.
TEXT_UPDATE_VERSION_CHECK_FAILED	= Version check failed
TEXT_UPDATE_VERSION_CHECKING		= Version checking
TEXT_UPDATE_DOWNLOAD_FAILED		= Download failed
TEXT_UPDATE_LATEST_VERSION		= Up to date
TEXT_UPDATE_DO_DOWNLOAD			= Updates needed
TEXT_UPDATE_DOWNLOAD_COMPLETED		= Download completed

TEXT_MSG_LASTPAGE			= This is the last image.
TEXT_MSG_FIRSTPAGE			= This is the first image.
TEXT_MSG_NOIMAGEFILE			= There is no image in the compressed file.
TEXT_MSG_INVALID_PHOTOFOLDER		= Please set the 'Photo Folder' path in the configuration.
TEXT_MSG_CANTOPENARCHIVE		= Failed to open the file:
TEXT_MSG_INVALID_ARCHIVE_VERSION	= This file isn't supported. Please update to the latest version.
TEXT_MSG_INVALID_PASSWORD		= Wrong password.
TEXT_MSG_STRETCHWHENSMALL_ON		= Stretch Small Images: On
TEXT_MSG_STRETCHWHENSMALL_OFF		= Stretch Small Images: Off
TEXT_MSG_CANTOPENBOOKMARK		= Failed to open the bookmarks.
TEXT_MSG_BROKENARCHIVE			= This compressed file is damaged.
TEXT_MSG_ADDTOBOOKMARK			= Add to Bookmarks: 
TEXT_MSG_LOADRECENTBOOKMARK		= Open recently saved bookmark:
TEXT_MSG_SLIDESHOWSTART			= Start Slideshow: ${TIME}sec
TEXT_MSG_SLIDESHOWSTOP			= Stop Slideshow
TEXT_MSG_ALWAYSONTOP_ON			= Always On Top: On
TEXT_MSG_ALWAYSONTOP_OFF		= Always On Top: Off
TEXT_MSG_ZOOMFIX_ON			= Fix zoom in/out: On
TEXT_MSG_ZOOMFIX_OFF			= Fix zoom in/out: Off
TEXT_MSG_EXTPROGERR_LAUNCH		= Opening with Image Editor
TEXT_MSG_EXTPROGERR_NOTSET		= Please select the Image Editor in the configuration (Paint, Photoshop, etc.). 
TEXT_MSG_ARCHIVEBOOKMARK		= Remember the location within compressed file:
TEXT_MSG_RESTART_NOTIFY			= This program will restart.
TEXT_MSG_COPY2CLIPBOARD			= Copied to clipboard.
TEXT_MSG_COPY2CLIPBOARD_FAILED		= Failed to copy to clipboard.
TEXT_MSG_BOOKMARK_EXPORTED		= The bookmark has been saved.
TEXT_MSG_BOOKMARK_EXPORT_FAILED		= Failed to save the bookmarks.
TEXT_MSG_BOOKMARK_OPEN_FAILED		= Failed to open the bookmarks 
TEXT_MSG_BOOKMARK_IMPORT_FAILED		= Failed to import the bookmarks.
TEXT_MSG_BOOKMARK_IMPORTED		= Bookmarks have been imported.
TEXT_MSG_SETWALLPAPER_FAILED		= Failed to set as desktop background.
TEXT_MSG_CANT_OPEN_IMAGE		= Can't open the image file.
TEXT_MSG_TRANSFORM_COMPLETED		= Processing completed.
TEXT_MSG_TRANSFORM_ERR_CANT_OPEN_FILE	= Can't open the file.
TEXT_MSG_TRANSFORM_ERR_CANT_SAVE_FILE	= Can't save the file.
TEXT_MSG_CANT_OPEN_MMF			= Can't open MMF. (mmf:${str1})
TEXT_MSG_NOTICE_RESTART			= This program will restart.
TEXT_MSG_DELETED			= Deleted

TEXT_ASK_INIT				= Do you want to reset to defaults?
TEXT_ASK_DELETE_IMAGE			= Are you sure you want to move this file to the Recycle Bin?
TEXT_ASK_DELETE_ARCHIVE			= Current image is a part of compressed file.[br][br]Do you want to delete the compressed file (${FILENAME})?
TEXT_ASK_DELETE_BOOKMARKALL		= Do you want to delete all the saved bookmarks?
TEXT_ASK_LAUNCH_ASSOCUI			= For Windows 8 or later versions, users are required to associate the extensions manually. [br][br]Do you want to associate the extensions?
TEXT_ASK_STOP_BATCH_PROCESSING		= Processing is under progress. Do you want to cancel it?

TEXT_FILTERMODE_NONE			= No Filter
TEXT_FILTERMODE_BILINEAR		= Filter: Soften
TEXT_FILTERMODE_SHARPEN			= Filter: Soften+Sharpen

TEXT_SHOWMODE_NONE			= View: Original Size (100%)
TEXT_SHOWMODE_FIT2WINDOW		= View: Fit in Window
TEXT_SHOWMODE_FIT2WIDTH			= View: Fit to Width
TEXT_SHOWMODE_TWO_L2R			= Smart Double page (Left->Right)
TEXT_SHOWMODE_TWO_R2L			= Smart Double page (Left<-Right)

TEXT_NEXTPATH_NOFILE			= Move Folder: Unable to navigate (Please open a file)
TEXT_NEXTPATH_LASTFOLDER		= Next Folder: Unable to navigate
TEXT_PREVPATH_LASTFOLDER		= Previous Folder: Unable to navigate
TEXT_NEXTPATH_OPENFOLDER		= Next Folder:
TEXT_PREVPATH_OPENFOLDER		= Previous Folder:

TEXT_DELETE				= Delete: 
TEXT_COPY_TO_PHOTOFOLDER1		= Copy to Photo Folder 1:
TEXT_COPY_TO_PHOTOFOLDER2		= Copy to Photo Folder 2:
TEXT_MOVE_TO_PHOTOFOLDER1		= Move to Photo Folder 1:

TEXT_SELECTFILEDLG_FILELIST		= List
TEXT_SELECTFILEDLG_DATE			= Date Modified
TEXT_SELECTFILEDLG_SIZE			= Size

TEXT_BOOKMARKEDITDLG_PATH		= Path

TEXT_PAGETURNFX_NONE			= No Effect
TEXT_PAGETURNFX_HV2			= Flip
TEXT_PAGETURNFX_ALPHA			= Fade
TEXT_PAGETURNFX_SLIDE			= Slide

TEXT_FILEINFO_FILENAME			= File Name
TEXT_FILEINFO_SIZE			= Image Size
TEXT_FILEINFO_CREATETIME		= Date Created
TEXT_FILEINFO_MODIFYTIME		= Date Modified
TEXT_FILEINFO_IMGINFO			= Image Information
TEXT_FILEINFO_ROTATE			= Rotation Information
TEXT_FILEINFO_ZOOM			= Zoom In/Out

TEXT_EXIF_MAKER				= Make
TEXT_EXIF_MODEL				= Camera Model
TEXT_EXIF_SOFTWARE			= Software
TEXT_EXIF_ARTIST			= Artist
TEXT_EXIF_COPYRIGHTPHOTOGRAPHER		= Copyright
TEXT_EXIF_DATETIME			= Shooting Date/Time
TEXT_EXIF_FLASHUSED			= Flash
TEXT_EXIF_FOCALLENGTH			= Focal Length
TEXT_EXIF_FOCALLENGTH_35MM		= 35mm Equivalent
TEXT_EXIF_EXPOSURETIME			= Exposure Time
TEXT_EXIF_EXPOSUREBIAS			= Exposure Bias
TEXT_EXIF_APERTUREFNUMBER		= Aperture Number
TEXT_EXIF_ISOEQUIVALENT			= ISO Speed
TEXT_EXIF_METERINGMODE			= Metering Mode
TEXT_EXIF_EXPOSUREPROGRAM		= Exposure Program
TEXT_EXIF_DISTANCE			= Focus Distance
TEXT_EXIF_GPS				= GPS Information
TEXT_EXIF_COMMENT			= Comment

TEXT_CUSTOMCMD_NOOPERATION		= Do nothing
TEXT_CUSTOMCMD_FULLSCREEN		= Full Screen
TEXT_CUSTOMCMD_MAXIMIZE			= Maximize
TEXT_CUSTOMCMD_MINIMIZE			= Minimize
TEXT_CUSTOMCMD_PAGESELECT		= Select Image
TEXT_CUSTOMCMD_EXIT			= Exit
TEXT_CUSTOMCMD_OPEN			= Open File
TEXT_CUSTOMCMD_OPENFOLDER		= Open Folder
TEXT_CUSTOMCMD_NEXT1			= Next 1 Page (Double view) 
TEXT_CUSTOMCMD_PREV1			= Previous 1 Page (Double view)
TEXT_CUSTOMCMD_NEXT			= Next Image
TEXT_CUSTOMCMD_PREV			= Previous Image
TEXT_CUSTOMCMD_NEXT_RANDOM		= Next Random Image
TEXT_CUSTOMCMD_PREV_RANDOM		= Previous Random Image
TEXT_CUSTOMCMD_HOME			= First Image
TEXT_CUSTOMCMD_END			= Last Image
TEXT_CUSTOMCMD_NEXT10			= Next 10th Image
TEXT_CUSTOMCMD_PREV10			= Previous 10th Image
TEXT_CUSTOMCMD_SCROLL_UP		= Scroll Up
TEXT_CUSTOMCMD_SCROLL_DN		= Scroll Down
TEXT_CUSTOMCMD_SCROLL_LEFT		= Scroll Left
TEXT_CUSTOMCMD_SCROLL_RIGHT		= Scroll Right
TEXT_CUSTOMCMD_ZOOM_IN			= Zoom In
TEXT_CUSTOMCMD_ZOOM_OUT			= Zoom Out
TEXT_CUSTOMCMD_COPY2PHOTOFOLDER		= Copy to Photo Folder
TEXT_CUSTOMCMD_MOVE2PHOTOFOLDER		= Move to Photo Folder
TEXT_CUSTOMCMD_COPY2PHOTOFOLDER2	= Copy to Photo Folder2
TEXT_CUSTOMCMD_NEXTPATH			= Next Compressed File/Folder
TEXT_CUSTOMCMD_PREVPATH			= Previous Compressed File/Folder
TEXT_CUSTOMCMD_CONTEXT_MENU		= Context Menu
TEXT_CUSTOMCMD_EXIFSHOW_TOGGLE		= Show File/EXIF information

TEXT_COMBO_GIF_TRANS_OPTION_0		= Use Original GIF Palette
TEXT_COMBO_GIF_TRANS_OPTION_1		= Use White Background Color
TEXT_COMBO_GIF_TRANS_OPTION_2		= Use Grid Background
TEXT_COMBO_GIF_TRANS_OPTION_3		= Use Black Background Color

TEXT_COMBO_LASTFILE_ACTION_NONE		= Do nothing
TEXT_COMBO_LASTFILE_ACTION_ASK		= Ask
TEXT_COMBO_LASTFILE_ACTION_LOOP		= Go to the First File
TEXT_COMBO_LASTFILE_ACTION_NEXTPATH	= Go to the Next/Previous Folder/File

TEXT_ASSOC_GROUP0			= Frequently Used Image Formats
TEXT_ASSOC_GROUP1			= Newly introduced Image Formats
TEXT_ASSOC_GROUP2			= Camera Lossless Image Formats
TEXT_ASSOC_GROUP3			= Compressed Image File Formats

TEXT_SORT_METHOD_FILENAME		= Sort by Name
TEXT_SORT_METHOD_DATE			= Sort by Date modified
TEXT_SORT_METHOD_SIZE			= Sort by Size
TEXT_SORT_METHOD_EXT			= Sort by Type

TEXT_TRANSF_RESIZE_NONE			= Do not resize
TEXT_TRANSF_RESIZE_KEEPRATIO		= Preserve original ratio
TEXT_TRANSF_RESIZE_FITWIDTH		= Fit to Width
TEXT_TRANSF_RESIZE_ADD			= Add Padding 
TEXT_TRANSF_RESIZE_CUT			= Crop Image
TEXT_TRANSF_RESIZE_STRETCH		= Stretch Image

TEXT_TRANSF_FORMAT_TO_SAVE_AUTO		= Auto
TEXT_TRANSF_FORMAT_TO_SAVE_JPG		= JPG
TEXT_TRANSF_FORMAT_TO_SAVE_PNG		= PNG

TEXT_BTN_PREV_FOLDER			= Previous Folder ( [ )
TEXT_BTN_NEXT_FOLDER			= Next Folder ( ] )
TEXT_BTN_PREV_ARCHIVE			= Prev. Compressed File ( [ )
TEXT_BTN_NEXT_ARCHIVE			= Next Compressed File ( ] )


[MENU]
MENUSTR_OPEN				= Open\tF2
MENUSTR_OPENFOLDER			= Open Folder\tF
MENUSTR_CLOSE				= Close\tF4
MENUSTR_PAGESELECT			= Select Image\tEnter
MENUSTR_OPEN_FILEPOSITION		= Show in Windows Explorer\tCtrl+Enter

MENUSTR_FILTER_NONE			= No Filter\tU
MENUSTR_FILTER_BILINEAR			= Soften\tI
MENUSTR_FILTER_SHARPEN			= Soften+Sharpen\tS

MENUSTR_PAGEMOVE			= Navigation
MENUSTR_PAGEMOVE_NEXT			= Next Image\t->
MENUSTR_PAGEMOVE_PREV			= Previous Image\t<-
MENUSTR_PAGEMOVE_HOME			= First Image\tHome
MENUSTR_PAGEMOVE_END			= Last Image\tEnd
MENUSTR_PAGEMOVE_NEXT10			= Next 10th Image\tCtrl+PageDown
MENUSTR_PAGEMOVE_PREV10			= Previous 10th Image\tCtrl+PageUp
MENUSTR_PAGEMOVE_RAND_NEXT		= Next Random Image\tCtrl+Alt+PageDown
MENUSTR_PAGEMOVE_RAND_PREV		= Previous Random Image\tCtrl+Alt+PageUp
MENUSTR_PAGEMOVE_NEXT_PATH		= Next Folder/Compressed File\t]
MENUSTR_PAGEMOVE_PREV_PATH		= Previous Folder/Compressed File\t[

MENUSTR_INTERPOLATEMODE			= Interpolation
MENUSTR_INTERPOLATEMODE_BILINEAR	= Bilinear Interpolation (Fast)
MENUSTR_INTERPOLATEMODE_BICUBIC		= Bicubic Interpolation (Slow, High Quality)
MENUSTR_INTERPOLATEMODE_LANCZOS		= Lanczos Interpolation (Slow, High Quality)

MENUSTR_IMAGE_PROCESSING		= Image Effect
MENUSTR_IMAGE_PROCESSING_NEGATIVE	= Reverse Image\tCtrl+I
MENUSTR_IMAGE_PROCESSING_GAMMA		= Gamma Compensation\tCtrl+G
MENUSTR_IMAGE_PRICESSING_FLIP		= Flip Vertical\tCtrl+F
MENUSTR_IMAGE_PRICESSING_MIRROR		= Flip Horizontal\tCtrl+M

MENUSTR_SORT_METHOD			= Sort by
MENUSTR_SORT_METHOD_FILENAME		= Name
MENUSTR_SORT_METHOD_DATE		= Date modified
MENUSTR_SORT_METHOD_SIZE		= Size
MENUSTR_SORT_METHOD_EXT			= Type
MENUSTR_SORT_DESCENDING			= Descending

MENUSTR_SHOWMODE			= View Image
MENUSTR_FILTER_STRETCHWHENSMALL		= Stretch Small Images\tZ
MENUSTR_SHOWMODE_NONE			= Original Size (100%)\t0
MENUSTR_SHOWMODE_STRETCH		= Fit in Window\t9
MENUSTR_SHOWMODE_FITWIDTH		= Fit to Width\t8
MENUSTR_SHOWMODE_TWO_L2R		= Smart Double page (Left->Right)\t7
MENUSTR_SHOWMODE_TWO_R2L		= Smart Double page (Left<-Right)\t6

MENUSTR_ZOOM				= Zoom
MENUSTR_ZOOM_IN				= Zoom In\t+
MENUSTR_ZOOM_OUT			= Zoom Out\t-
MENUSTR_ZOOM_FIX			= Fix\tCtrl+K
MENUSTR_ZOOM_100			= 100%\t*
MENUSTR_ZOOM_IN_1			= Zoom In(1%)\tCtrl++
MENUSTR_ZOOM_OUT_1			= Zoom Out(1%)\tCtrl+-

MENUSTR_ROTATION			= Rotate
MENUSTR_ROTATION_NONE			= Do not rotate\tAlt+Up
MENUSTR_ROTATION_L90			= Rotate 90˚ counter-clockwise\tAlt+Left
MENUSTR_ROTATION_R90			= Rotate 90˚ clockwise\tAlt+Right
MENUSTR_ROTATION_180			= 180˚\tAlt+Down

MENUSTR_EXIFSHOW_TOGGLE			= File/EXIF information\tTAB
MENUSTR_WALLPAPER			= Set as Desktop Background
MENUSTR_DELETE				= Delete\tDel
MENUSTR_COPY_TO_PHOTOFOLDER		= Copy to Photo Folder\tIns
MENUSTR_EXTPROG0			= Open with Image Editor\tCtrl+E
MENUSTR_PRINT				= Print\tCtrl+P
MENUSTR_COPY2CLIPBOARD			= Copy to Clipboard\tCtrl+C

MENUSTR_SETTING				= Configuration\tF5
MENUSTR_ABOUT				= About Honeyview\tF1
MENUSTR_EXIT				= Exit\tX

; about popup menu
MENUSTR_HOMEPAGE			= Website
MENUSTR_HELP				= Hotkey Help

; bookmark popup menu
MENUSTR_BOOKMARK_ADD			= Add to Bookmarks\tB
MENUSTR_BOOKMARK_DELALL			= Delete All Bookmarks
MENUSTR_BOOKMARK_SETTTING		= Bookmark Settings
MENUSTR_BOOKMARK_EDIT			= Edit Bookmarks\tF3

; slideshow popup menu
MENUSTR_SLIDESHOW_00			= Stop Slideshow\tCtrl+0
MENUSTR_SLIDESHOW_01			= 1 second\tCtrl+1
MENUSTR_SLIDESHOW_02			= 2 seconds\tCtrl+2
MENUSTR_SLIDESHOW_03			= 3 seconds\tCtrl+3
MENUSTR_SLIDESHOW_04			= 4 seconds\tCtrl+4
MENUSTR_SLIDESHOW_05			= 5 seconds\tCtrl+5
MENUSTR_SLIDESHOW_06			= 6 seconds\tCtrl+6
MENUSTR_SLIDESHOW_07			= 7 seconds\tCtrl+7
MENUSTR_SLIDESHOW_08			= 8 seconds\tCtrl+8
MENUSTR_SLIDESHOW_09			= 9 seconds\tCtrl+9
MENUSTR_SLIDESHOW_10			= 10 seconds
MENUSTR_SLIDESHOW_15			= 15 seconds
MENUSTR_SLIDESHOW_20			= 20 seconds
MENUSTR_SLIDESHOW_25			= 25 seconds
MENUSTR_SLIDESHOW_30			= 30 seconds
MENUSTR_SLIDESHOW_60			= 60 seconds
MENUSTR_SLIDESHOW_90			= 90 seconds
MENUSTR_SLIDESHOW_LOOP			= Repeat
MENUSTR_SLIDESHOW_RANDOM		= Random

MENUSTR_PAGETURNFX_NONE			= No Effect
MENUSTR_PAGETURNFX_HV2			= Flip
MENUSTR_PAGETURNFX_ALPHA		= Fade
MENUSTR_PAGETURNFX_SLIDE		= Slide

MENUSTR_PHOTOFOLDER_COPY1		= Copy to Photo Folder 1\tInsert
MENUSTR_PHOTOFOLDER_MOVE1		= Move to Photo Folder 1\tCtrl+Insert
MENUSTR_PHOTOFOLDER_COPY2		= Copy to Photo Folder 2\tShift+Insert
MENUSTR_PHOTOFOLDER_SETTING		= Photo Folder Settings
MENUSTR_PHOTOFOLDER_OPEN		= Open Photo Folder 1

MENUSTR_TRANSFORMDLG			= Convert Image (Rotate, Resize)\tCtrl+T

[DIALOG]
IDCANCEL				= Cancel
IDOK					= OK

[IDD_ABOUT]  
IDD_ABOUT				= About Honeyview
IDC_BTN_HOMEPAGE			= Website
IDC_BTN_UPDATE				= Update

[IDD_SETTING]
IDD_SETTING				= Configuration
IDC_BTN_INIT				= Reset

[IDD_SETTING_GENERAL]
IDC_STATIC_SETTING			= General settings
IDC_CHK_USESNAP				= Snap window
IDC_CHK_DONOTREMEMBERFOLDER		= Do not save recent folder path
IDC_CHK_ONE_INSTANCE			= Do not allow multiple instances of Honeyview
IDC_CHK_ASK_DELETE			= Ask for confirmation before deleting a file
IDC_CHK_NO_CENTER_MESSAGE		= Display notification messages in the corner rather than the center
IDC_CHK_ALWAYS_ON_TOP			= Always on top (Ctrl+A)
IDC_CHK_ESC_TO_EXIT			= ESC key to exit window
IDC_CHK_CHECK_UPDATE			= Check for the latest version
IDC_CHK_CHECK_UPDATE_MINOR		= Check for minor versions
IDC_STATIC_LASTFILEACTION_IMAGE		= Action when on last/first image:
IDC_STATIC_LASTFILEACTION_ARCHIVE	= Action when on last/first image in archive:

[IDD_SETTING_VIEW]
IDC_STATIC_VIEW				= View settings
IDC_CHK_SHOWBORDER			= Show main window border
IDC_CHK_SHOW_OVERLAY_FILEINFO		= Show file name on image when top menu is hidden (Hotkey: Shift+TAB)
IDC_CHK_SAVE_ZOOM_FIX			= Save fixed zoom in/out state
IDC_CHK_DO_NOT_SHOW_TITLE_BAR		= Do not display the top menu bar
IDC_CHK_DO_NOT_SHOW_CONTROL_BAR		= Do not display the bottom control bar
IDC_CHK_DO_NOT_SIDE_ARROW		= Do not display the side arrow buttons
IDC_CHK_DO_NOT_SHOW_ANIMINFO		= Do not display the animation-info control
IDC_CHK_DO_NOT_SHOW_ZOOMINFO		= Do not display the zoom-info control
IDC_CHK_HIDE_TOOLTIP_HELP		= Do not display tooltips on mouseover
IDC_CHK_EXIFINFO_SMALL_FONT		= Use small font for EXIF/file info
IDC_CHK_USEBKGNDIMAGE			= Change default background image
IDC_BTN_BKGND_SET			= Browse...
IDC_BTN_BKGND_OPEN			= Open Folder
IDC_STATIC_BKGNDCOLOR			= Background Color:
IDC_BTN_BKGND				= Select...
IDC_STATIC_BORDERCOLOR			= Border Color:
IDC_BTN_BORDERCOLOR			= Select...

[IDD_SETTING_BOOKMARK]
IDC_STATIC_BOOKMARK			= Bookmark settings
IDC_CHK_AUTOBOOKMARK			= Auto save the current image path to Bookmarks
IDC_CHK_SHARE_SETTING			= Share configuration/bookmarks among multiple instances.
IDC_CHK_REMEMBER_FILEPOS_IN_ARCHIVE	= Auto remember current image path in compressed image files
IDC_BTN_CLEAR_FILE_POS_IN_ARCHIVE	= Delete
IDC_STATIC_MAX_BOOKMARK			= Max. Bookmark Number:

[IDD_SETTING_ASSOC]
IDC_STATIC_ASSOC_IMAGE			= Associated file extension list
IDC_BTN_IMAGE_SELECT			= Select All
IDC_BTN_IMAGE_DESELECT			= Deselect All
IDC_BTN_APPLY_NOW			= Apply Now

[IDD_SETTING_ASSOC_NEW]
IDC_STATIC_ASSOC_IMAGE			= Extension Association
IDC_STATIC_ASSOC_DESC1			= For Windows 8 or later versions, you can associate the files as follows:
IDC_STATIC_ASSOC_DESC2			= 1. Click the following "Association Settings" button.
IDC_STATIC_ASSOC_DESC3			= 2. Check "Select All" in Program Association Settings window.
IDC_STATIC_ASSOC_DESC4			= 3. Click "Save" button.
IDC_STATIC_ASSOC_DESC1_10		= For Windows 10 or later versions, you can associate the files as follows:
IDC_STATIC_ASSOC_DESC2_10		= 1. Click the following "Association Settings" button.
IDC_STATIC_ASSOC_DESC3_10		= 2. Go to Photo viewer in the Default apps window.
IDC_STATIC_ASSOC_DESC4_10		= 3. Select "Honeyview" as the default photo viewer.
IDC_BTN_LAUNCH_ASSOC_REG_UI		= Association Settings
IDC_BTN_SHOW_CLASSIC_ASSOC_UI		= Classic method

[IDD_SETTING_IMAGEPROCESSING]
IDC_STATIC_IMAGEPROCESSING		= Image Processing
IDC_CHK_EXIFROTATION			= Auto rotate images based on EXIF info
IDC_CHK_STRONG_SHARPEN			= Use strong sharpen filter
IDC_CHK_CACHE_IMAGE			= Cache next image
IDC_STATIC_CACHE_MEMORY_SIZE		= Cache memory size: 
IDC_CHK_ALIGN_TOP_WHEN_LARGE		= Show the top of the image if the image is bigger than window
IDC_CHK_USE_PREVIEW_MODE		= Display low quality images first for faster rendering
IDC_CHK_USE_IMAGE_ICC			= Use the ICC profile data of the image file
IDC_CHK_USE_MONITOR_ICC			= Use the ICC profile data of the monitor
IDC_STATIC_GIF_TRANSPARENT_OPTION	= Transparent background for GIF images:
IDC_STATIC_IMAGE_TRANSPARENT_OPTION	= Transparent background for 32-bit images:
IDC_STATIC_IMAGE_INTERPOLATE_OPTION	= Interpolation (Resize filter):
IDC_STATIC_PAGETURNFX			= Page turning effect:

[IDD_SETTING_CUSTOM_KEY]
IDC_STATIC_CUSTOMKEYDESC_ENABLE		= Check
IDC_STATIC_CUSTOMKEYDESC_KEY		= Hotkey
IDC_STATIC_CUSTOMKEYDESC_ACTION		= Action

[IDD_SETTING_CUSTOM_MOUSE]
IDC_STATIC_CUSTOMMOUSE_ENABLE		= Setting
IDC_STATIC_CUSTOMMOUSE_ACTION		= Action
IDC_CHK_CUSTOM_LBUTTON			= Left button
IDC_CHK_DBLCLICK2MAXIMIZE		= Maximize/Restore by double clicking
IDC_CHK_CLICK2PAGETURN			= Turn page when left or right side of screen is clicked
IDC_CHK_CUSTOM_MBUTTON			= Middle button
IDC_CHK_CUSTOM_RBUTTON			= Right button
IDC_CHK_CUSTOM_XBUTTON			= X button
IDC_CHK_CUSTOM_YBUTTON			= Y button
IDC_CHK_CUSTOM_WHEELUP			= Mousewheel up 
IDC_CHK_CUSTOM_WHEELDN			= Mousewheel down

[IDD_SETTING_SHELL]
IDC_STATIC_SHELL_TITLE			= Context menu settings
IDC_CHK_SHELL_USE_SHELL_MENU		= Use context menu in Windows Explorer
IDC_CHK_SHELL_TRANSFORM_DLG		= Convert image with Honeyview
IDC_CHK_SHELL_SHOW_WITH_HONEYVIEW	= View image with Honeyview
IDC_CHK_SHELL_PREVIEW_IMAGE		= Preview in context menu
IDC_CHK_SHELL_SHOW_IMAGE_INFO		= Show image info
IDC_CHK_SHELL_SHOW_ICON			= Show Honeyview icon
IDC_STATIC_SHELL_THUMB_PREVIEW		= Thumbnail preview in Explorer

[IDD_SETTING_ETC]
IDC_STATIC_SETTING_ETC			= Miscellaneous settings
IDC_STATIC_PHOTOFOLDER			= Photo Folder
IDC_STATIC_PHOTOFOLDER_DESC1		= Photo Folder 1:
IDC_STATIC_PHOTOFOLDER_DESC2		= Photo Folder 2:
IDC_BTN_PHOTOFOLDER_SET1		= Browse...
IDC_BTN_PHOTOFOLDER_OPEN1		= Open
IDC_BTN_PHOTOFOLDER_SET2		= Browse...
IDC_BTN_PHOTOFOLDER_OPEN2		= Open
IDC_STATIC_EXTPROGRAM			= Image Editor
IDC_BTN_SET_EXTPROG0			= Browse...
IDC_BTN_SET_EXTPROG1_FAST		= Preset
IDC_CHK_PAGETURNWAV			= Sound effect for page turning
IDC_CHK_DO_NOT_LOAD_RAW_IMAGE_FILE	= Do not open RAW image files
IDC_CHK_SKIP_RAWIMAGE_WHEN_JPG_EXIST	= When opening JPEG files, do not open RAW image files with the same name
IDC_CHK_READ_THUMBNAIL_WHEN_LOAD_RAW	= When opening RAW image files, show thumbnail image if any
IDC_CHK_RESIZE_WINDOW_2_FITIMAGE	= Adjust window size to image size
IDC_CHK_DISABLE_SCREEN_SAVER		= Disable Windows screensaver while Honeyview is running

[IDD_SETTING_LANG]
IDC_STATIC_LANG				= Language settings
IDC_STATIC_OPEN_MULTLANG_PAGE		= [Download more languages...]
IDC_STATIC_OPEN_LANG_FOLDER		= [Open language folder...]

[IDD_PAGESELECT]
IDD_PAGESELECT				= Select Image
IDC_CHECK_SHOW_THUMBNAIL		= Hide thumbnail navigation

[IDD_PASSINPUT]
IDD_PASSINPUT				= Enter Password
IDC_STATIC_PASSDESC			= This file is encrypted. Please enter password.

[IDD_BOOKMARK_EDIT]
IDD_BOOKMARK_EDIT			= Edit Bookmarks
IDC_BTN_DEL				= Delete
IDC_BTN_IMPORT				= Import Bookmarks
IDC_BTN_EXPORT				= Export Bookmarks

[IDD_PRINT]
IDD_PRINT				= Print
IDC_GROUP_PRINTER			= Select Printer
IDC_BTN_PRINTER_PROPERTY		= Properties
IDC_CHK_ROTATE				= Rotate 90˚
IDC_CHK_FIT_IN				= Scale to fit paper
IDC_STATIC_ZOOM				= Scale:
IDC_STATIC_MARGIN_L			= Margins Left:
IDC_STATIC_MARGIN_T			= Top:
IDC_STATIC_MARGIN_R			= Right:
IDC_STATIC_MARGIN_B			= Bottom:
IDC_STATIC_COPIES			= Copies:
IDC_BTN_PRINT				= Print
IDC_BTN_CLOSE				= Close

[IDD_UPDATE]
IDD_UPDATE				= Honeyview Updates
IDC_STATIC_MESSAGE_1			= Honeyview updates are ready.
IDC_STATIC_MESSAGE_2			= Click the Update button to install the newest version.
IDOK					= Update
IDCANCEL				= Cancel
IDC_BTN_SETTING_UPDATE			= Settings

[IDD_ASK_OVERWRITE]
IDD_ASK_OVERWRITE			= Rename or Overwrite
IDC_STATIC_ASK_OVERWRITE		= The file already exists.
IDC_STATIC_SRC				= Current Image
IDC_STATIC_DST				= Target Image
IDC_BTN_OVERWRITE			= Overwrite
IDC_BTN_RENAME				= Save As...

[IDD_WALLPAPER]
IDD_WALLPAPER				= Set Desktop Background
IDC_STATIC_PREVIEW			= Preview
IDC_STATIC_BACK_COLOR			= Background color
IDC_RADIO_BACKCOLOR_0			= Black
IDC_RADIO_BACKCOLOR_1			= Auto
IDC_RADIO_BACKCOLOR_2			= Custom...
IDC_BTN_BKGND				= Select...
IDC_BTN_CLOSE				= Close
IDC_BTN_APPLY				= Apply Now

[IDD_OPEN_PROGRESS]
IDD_OPEN_PROGRESS			= Open File
IDC_STATIC_OPENING			= Opening...

[IDD_SELECT_FOLDER]
IDD_SELECT_FOLDER			= Select Folder
IDC_STATIC_FOLDER			= Folder Path:
IDC_BTN_NEWFOLDER			= New Folder
IDC_CHK_OPEN_SUBFOLDER			= Include all files from sub-folders

[IDD_TRANSFORM]
IDD_TRANSFORM				= Image Conversion
IDC_STATIC_FILELIST			= File List
IDC_STATIC_PREVIEW			= Preview
IDC_BTN_START				= Start
IDC_BTN_CLOSE				= Close
IDC_BTN_OPEN_DEST_FOLDER		= Open Folder

[IDD_TRANSFORM_OPT]
IDC_STATIC_ROTATE			= Rotate
IDC_RADIO_ROTATE_NONE			= Do not rotate
IDC_RADIO_ROTATE_LEFT			= Rotate 90˚ counter-clockwise
IDC_RADIO_ROTATE_RIGHT			= Rotate 90˚ clockwise
IDC_RADIO_ROTATE_180			= Rotate 180˚
IDC_RADIO_ROTATE_AUTO			= Auto-rotate according to EXIF info
IDC_STATIC_RESIZE			= Resize
IDC_STATIC_RESIZE_SIZE			= New Size

IDC_STATIC_FORMAT			= Format Settings
IDC_STATIC_FORMAT_SELECT		= Format:
IDC_STATIC_FORMAT_QUALITY		= Quality:
IDC_STATIC_SAVE				= Output folder
IDC_RADIO_TARGETFOLDER_SAMEFOLDER	= Save to Original Folder
IDC_RADIO_TARGETFOLDER_PHOTOFOLDER	= Save to Photo Folder
IDC_RADIO_TARGETFOLDER_CUSTOM		= Save to:
IDC_STATIC_FILENAME_HEADER		= Filename Prefix
IDC_STATIC_FILENAME2SAVE		= Filename Preview
IDC_BTN_INIT				= Reset


[SKIN]
$TT_FULLSCREEN				= Fullscreen (Alt+Enter)
$TT_TOGGLE_ZOOM_CONTROL			= Hotkey: /
$TT_TOGGLE_ANIMINFO_CONTROL		= Hotkey: Alt+Z
$TT_PAGESELECT				= Select Image (Enter)
$TT_LOCKCONTROLBAR			= Lock Controls (Hotkey: ~)
$TT_LOCKTITLEBAR			= Lock Menu (Hotkey: `)
$TT_COPY_EXIFINFO			= Copy Image/EXIF Info (Ctrl+Shift+C)
$TT_TOGGLE_EXIF				= Show/Hide Image/EXIF Info (Hotkey: Tab)
$TT_LAUNCH_GPS_LOCATION			= See the location on Google Maps.(Ctrl+Shift+G)
$TT_PLAY_SOUNDNSHOT			= Play the audio file (Sound and Shot file).
$TT_CLOSE_EXIFINFO			= Close (Hotkey: Tab)
$TT_PREV_BTN				= L-Mouse:Previous, R-Mouse:Previous 10th
$TT_NEXT_BTN				= L-Mouse:Next, R-Mouse:Next 10th

$BTN_TEXT_EXIF				= EXIF
$BTN_TEXT_GPS				= GPS
$BTN_TEXT_PLAY_SOUNDNSHOT		= Sound&&Shot
$BTN_TEXT_SHOWMODE			= View
$BTN_TEXT_PHOTOFOLDER			= Copy to
$BTN_TEXT_EDIT				= Edit
$BTN_TEXT_STICKY			= Lock
$BTN_TEXT_BOOKMARK			= Bookmark
$BTN_TEXT_SLIDESHOW			= Slideshow
$BTN_TEXT_UPDATE			= New version available

$TEXT_SETTINGTAB_GENERAL		= General
$TEXT_SETTINGTAB_VIEW			= View
$TEXT_SETTINGTAB_BOOKMARK		= Bookmark
$TEXT_SETTINGTAB_ASSOC			= Association
$TEXT_SETTINGTAB_IMAGEPROCESS		= Image Processing
$TEXT_SETTINGTAB_KEYBOARD		= Keyboard
$TEXT_SETTINGTAB_MOUSE			= Mouse
$TEXT_SETTINGTAB_SHELL			= Context Menu
$TEXT_SETTINGTAB_ETC			= Miscellaneous
$TEXT_SETTINGTAB_LANG			= Language

$TEXT_DESKTOP				= Desktop
$TEXT_DOCUMENT				= Document
$TEXT_PICTURE				= Picture
$TEXT_COMPUTER				= Computer


[SHELL]
TEXT_LAUNCH_TRANSFORM_DLG		= Convert with Honeyview(&2)
TEXT_LAUNCH_HONEYVIEW			= View with Honeyview(&3)
TEXT_LOADING				= Loading...
TEXT_IMAGE_LOAD_FAILED			= Failed to load file
TEXT_IMAGE_LOAD_FAIL_NOT_SUPPORTED	= No Preview Available


[INSTALLER]
LNK_FILE_DESC				= Run Honeyview
UNINSTALLER_LNK_NAME 			= Program Uninstall

MSG_STILLRUN_EXIT_PROGRAM		= Honeyview is running. Please exit the program first.
MSG_ASK_DELETE_ALL_FILES		= Files in $INSTDIR have not been removed. [br]Remove all files?
MSG_ASK_RESTART_EXPLORER		= To finish the installation, Windows Explorer needs to restart. Do you want to restart it now?
MSG_ASK_UNINSTALL_HV3			= Honeyview3 is already installed. You need to remove installed Honeyview3 to install the new version. Do you want to proceed?
MSG_UNINSTALL_HV3_FAILED		= Failed to uninstall.
MSG_RESTART_EXPLORER			= Windows Explorer will restart to complete uninstallation of Honeyview3.

TEXT_LICENSE				= Honeyview License Agreement
TEXT_OPTIONS				= Installation Option
TEXT_OPT_PROGRAMGROUP			= Create program group
TEXT_OPT_DESKTOPSHORCUT			= Create shortcut on Desktop
TEXT_OPT_QUICKLAUNCH			= Create shortcut on Quick Launch
TEXT_OPT_FOLDER				= Destination Folder
TEXT_OPT_REGIMAGE			= Associate image file extensions
TEXT_SELECT_FOLDER			= Select folder
TEXT_LICENSE_LINK			= [Website]

TEXT_INSTALLER_MAIN_LICENSE_LINE_1	= END USER LICENSE AGREEMENT
TEXT_INSTALLER_MAIN_LICENSE_LINE_2	= Honeyview is a free ultrafast image viewer developed and distributed by Bandisoft.[br][br]This program is free for individual, enterprise, government, and more.

TEXT_ASK_RESTART_EXPLORER		= Windows Explorer will restart to complete the installation. Do you want to restart it now?
TEXT_NEED_ADMIN_PRIVILEGE		= This program can only be installed by user with Administrator's Rights.[br][br]Non-administrative users may not install the program properly.[br][br]Do you want to stop the installation?

